# GetLineWeight Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..GetLineWeight Method
Category Class See Also
---
Retrieves the line weight assigned to the category for the given graphics style type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Nullable<int> GetLineWeight(
	GraphicsStyleType graphicsStyleType
)
```

Visual Basic
---
```text
Public Function GetLineWeight ( _
	graphicsStyleType As GraphicsStyleType _
) As Nullable(Of Integer)
```

Visual C++
---
```text
public:
Nullable<int> GetLineWeight(
	GraphicsStyleType graphicsStyleType
)
```

# ### Parameters
graphicsStyleType
    Type: Autodesk.Revit.DB..::..GraphicsStyleTypeThe type of graphics style.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the input argument-"graphicsStyleType"-is out of range. |

# See Also
Category Class
Autodesk.Revit.DB Namespace